code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаПеречняБумагИнновационногоСектораЭкономики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПеречняБумагИнновационногоСектораЭкономики</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПереченьЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРегистрации</Name>
							<Comment>Номер государственной регистрации</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВключенияВПеречень</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИсключенияИзПеречня</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ПараметрыГлобальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыГлобальные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаПеречняБумагИнновационногоСектораЭкономики/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура загружает перечень бумаг высокотехнологичного (инновационного) сектора экономики с сайта ММВБ
// В табличную часть ПереченьЦБ обработки, при этом осуществляются ЦБ по ISIN по ISIN и рег. номеру,
// а также определяется, изменились ли даты включения и исключения в перечень
Процедура ЗагрузитьИнформациюССайтаММВБ() Экспорт
	АдресФайлаВИнтернете = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("618.АдресФайлаСоСпискомВысокотехнологичныхЦБ");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ЗагрузитьФайлИзИнтернета(АдресФайлаВИнтернете, ИмяВременногоФайла);
	ПрочитатьДанныеИзФайла(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	ОпределитьЦБ();
	ОпределитьЦБСИзмененнымиДатами();
КонецПроцедуры

// Процедура обновляет информацию в справочнике ЦБ о датах включения и исключения в перечень бумаг высокотехнологичного
// (инновационного) сектора экономики для тех ЦБ, для которых установлен флаг ЕстьИзменения в ТЧ ПереченьЦБ
Процедура ОбновитьИнформациюВСправочникеЦБ() Экспорт
	Для Каждого Строка Из ПереченьЦБ Цикл
		Если Строка.ЕстьИзменения И ЗначениеЗаполнено(Строка.ЦБ) Тогда
			ЦБОбъект = Строка.ЦБ.ПолучитьОбъект();
			ЦБОбъект.ДатаВключенияВПереченьБумагВИСЭ = Строка.ДатаВключенияВПеречень;
			ЦБОбъект.ДатаИсключенияИзПеречняБумагВИСЭ = Строка.ДатаИсключенияИзПеречня;
			Попытка
				ЦБОбъект.Записать();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ТекстОшибки = "Не удалось обновить информацию о датах включения и исключения в перечень бумаг высокотехнологичного"
								+ " сектора для ЦБ " + Строка(Строка.ЦБ) + "(ISIN " + Строка.ISIN + ") по причине: " + Символы.ПС 
								+ ПодробноеПредставлениеОшибки;
				ИмяСобытия = Метаданные().Имя;
				ЗаписьЖурналаРегистрации("ЗагрузкаПеречняБумагИнновационногоСектораЭкономики", УровеньЖурналаРегистрации.Ошибка, , ТекстОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура отправляет уведомления об изменении перечня бумаг инновационного сектора экономики по электронной почте
Процедура ОтправитьУведомлениеОбИзменениях() Экспорт
	СтрокиСИзменениями = ПереченьЦБ.НайтиСтроки(Новый Структура("ЕстьИзменения", Истина));
	Если СтрокиСИзменениями.Количество() > 0 Тогда
		ТемаПисьма = "Уведомление об изменении перечня бумаг инновационного сектора экономики";
		
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОбИзмененииПеречняБумагИнновационногоСектораЭкономики;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если НастройкиОбмена = Неопределено Тогда
			ТекстОшибки = ТемаПисьма + "не отправлено, так как " + "не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ИмяСобытия = ТемаПисьма + "не отправлено";
			ИмяСобытия = "Уведомление не отправлено";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			Возврат;
		КонецЕсли;
				
		ТекстПисьма = ТекстУведомленияОбИзмененииДат(СтрокиСИзменениями);
		
		ПараметрыУведомления = Новый Соответствие;
		ПараметрыУведомления.Вставить("Вложения",			Неопределено);
		ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
		ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
		ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
		ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
		ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
		ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПрочитатьДанныеИзФайла(ПолноеИмяФайла)
	ПереченьЦБ.Очистить();
	ДанныеФайла = Новый ТабличныйДокумент;
	ДанныеФайла.Прочитать(ПолноеИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Если ДанныеФайла.Область(1, 5).Текст <> "ISIN" Тогда
		Текст = "В файле Excel с перечнем бумаг инновационного сектора экономики формат данных отличается от ожидаемого ...";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текст");
		ИмяСобытия = "ЗагрузкаПеречняБумагИнновационногоСектораЭкономики";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Текст);
	Иначе
		СтрокаФайла = 2;
		Пока Истина Цикл
			ISIN = ДанныеФайла.Область(СтрокаФайла, 5).Текст;
			НомерРегистрации = ДанныеФайла.Область(СтрокаФайла, 6).Текст;
			ДатаВключенияВПереченьСтрокой = ДанныеФайла.Область(СтрокаФайла, 9).Текст;
			ДатаИсключенияИзПеречняСтрокой = ДанныеФайла.Область(СтрокаФайла, 10).Текст;
			Если ЗначениеЗаполнено(ISIN) Тогда
				НовСтрокаПеречня = ПереченьЦБ.Добавить();
				НовСтрокаПеречня.ISIN = ISIN;
				НовСтрокаПеречня.НомерРегистрации = НомерРегистрации;
				НовСтрокаПеречня.ДатаВключенияВПеречень = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаВключенияВПереченьСтрокой);
				НовСтрокаПеречня.ДатаИсключенияИзПеречня = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаИсключенияИзПеречняСтрокой);
				СтрокаФайла = СтрокаФайла + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОпределитьЦБ()
	Для Каждого СтрокаТЧ Из ПереченьЦБ Цикл
		СтрокаТЧ.ЦБ = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(СтрокаТЧ.ISIN, СтрокаТЧ.НомерРегистрации);
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ЦБ) Тогда
			ИмяСобытия = "Не найдена ЦБ инновационного сектора";
			КомментарийДляЖурналаРегистрации = "При загрузке списка бумаг инновационного сектора экономики не удалось найти ЦБ в справочнике ЦБ"
												+ " по ISIN " + СтрокаТЧ.ISIN + " и номеру гос. регистрации " + СтрокаТЧ.НомерРегистрации;
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , , КомментарийДляЖурналаРегистрации);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КомментарийДляЖурналаРегистрации);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОпределитьЦБСИзмененнымиДатами()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗПереченьЦБ.НомерСтроки КАК НомерСтроки,
	|	ТЗПереченьЦБ.ЦБ КАК ЦБ,
	|	ТЗПереченьЦБ.ДатаВключенияВПеречень КАК ДатаВключенияВПеречень,
	|	ТЗПереченьЦБ.ДатаИсключенияИзПеречня КАК ДатаИсключенияИзПеречня
	|ПОМЕСТИТЬ ВТ_Перечень
	|ИЗ
	|	&ТЗПереченьЦБ КАК ТЗПереченьЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Перечень.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Перечень КАК ВТ_Перечень
	|		ПО (ВТ_Перечень.ЦБ = ЦенныеБумаги.Ссылка)
	|			И (ВЫБОР
	|				КОГДА ВТ_Перечень.ДатаВключенияВПеречень <> ЦенныеБумаги.ДатаВключенияВПереченьБумагВИСЭ
	|					ТОГДА ИСТИНА
	|				КОГДА ВТ_Перечень.ДатаИсключенияИзПеречня <> ЦенныеБумаги.ДатаИсключенияИзПеречняБумагВИСЭ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)";
	ТЗПереченьЦБ = ПереченьЦБ.Выгрузить(, "НомерСтроки, ЦБ, ДатаВключенияВПеречень, ДатаИсключенияИзПеречня");
	Запрос.УстановитьПараметр("ТЗПереченьЦБ", ТЗПереченьЦБ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Индекс = Выборка.НомерСтроки - 1;
			ПереченьЦБ[Индекс].ЕстьИзменения = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьФайлИзИнтернета(АдресФайлаВИнтернете, АдресФайлаНаКлиенте)
	
	Если СтрНайти(НРег(АдресФайлаВИнтернете), "https://") = 1 Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Протокол = "https";
	Иначе
		ЗащищенноеСоединение = Неопределено;
		Протокол = "http";
	КонецЕсли;
	
	АдресПроксиСервера = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("ПроксиСерверАдрес");
	ПортПроксиСервера = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("ПроксиСерверПорт");
	
	ПроксиСервер = Новый ИнтернетПрокси;
	ПроксиСервер.Установить(Протокол, АдресПроксиСервера, ПортПроксиСервера);
	
	// "http://static.1c.ru/images/logo.png" -> "static.1c.ru/images/logo.png"
	АдресБезHTTP = СтрЗаменить(АдресФайлаВИнтернете, "//", Символы.ПС);
	АдресБезHTTP = СтрПолучитьСтроку(АдресБезHTTP, СтрЧислоСтрок(АдресБезHTTP));
	
	// "static.1c.ru/images/logo.png" -> "static.1c.ru"
	АдресСервера = СтрПолучитьСтроку(СтрЗаменить(АдресБезHTTP, "/", Символы.ПС), 1);
	
	// "static.1c.ru/images/logo.png" -> "/images/logo.png"
	ПутьКФайлуВнутриДомена = Сред(АдресБезHTTP, СтрНайти(АдресБезHTTP, "/"));
	
	// скачиваем на диск
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
						АдресФайлаВИнтернете, "Скачивание файла");
	КомментарийДляЛога = "ПроксиСервер: " + АдресПроксиСервера + " порт:" + Строка(ПортПроксиСервера);
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова, КомментарийДляЛога);
	Таймаут = 5;
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервера, , , , ПроксиСервер, Таймаут, ЗащищенноеСоединение);
		Соединение.Получить(ПутьКФайлуВнутриДомена, АдресФайлаНаКлиенте);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, КомментарийДляЛога);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ПредставлениеОшибки, КомментарийДляЛога);
		ИмяСобытия = "Не удалось скачать файл из интернета";
		КомментарийДляЖурналаРегистрации = "При попытке скачивания файла " + АдресФайлаВИнтернете + " " + КомментарийДляЛога
											+ " возникла ошибка" + ПредставлениеОшибки;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , КомментарийДляЖурналаРегистрации);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КомментарийДляЖурналаРегистрации);
	КонецПопытки;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + АдресФайлаНаКлиенте + " скачан успешно");
КонецПроцедуры

Функция ТекстУведомленияОбИзмененииДат(СтрокиСИзменениями)
	ПС = "<br>";		// Тег HTML означает перевод строки
	
	ТаблицаИзмененныхЦБ = Новый ТаблицаЗначений;
	ТаблицаИзмененныхЦБ.Колонки.Добавить("НаименованиеЦБ", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаИзмененныхЦБ.Колонки.Добавить("ISIN", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	ТаблицаИзмененныхЦБ.Колонки.Добавить("ДатаВключенияВПеречень", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	ТаблицаИзмененныхЦБ.Колонки.Добавить("ДатаИсключенияИзПеречня", ОбщегоНазначения.ОписаниеТипаСтрока(10));
		
	Для Каждого СтрокаТЧ Из СтрокиСИзменениями Цикл
		НовСтрокаТЗ = ТаблицаИзмененныхЦБ.Добавить();
		НовСтрокаТЗ.НаименованиеЦБ = Строка(СтрокаТЧ.ЦБ);
		НовСтрокаТЗ.ISIN = СтрокаТЧ.ISIN;
		НовСтрокаТЗ.ДатаВключенияВПеречень = Формат(СтрокаТЧ.ДатаВключенияВПеречень, "ДФ=""дд.ММ.гггг""");
		НовСтрокаТЗ.ДатаИсключенияИзПеречня = Формат(СтрокаТЧ.ДатаИсключенияИзПеречня, "ДФ=""дд.ММ.гггг""");
	КонецЦикла;
	
	ПараметрыТрансформацииВHTML = Новый Структура;
	ПараметрыТрансформацииВHTML.Вставить("ПунктПорядкуИспользуется", Истина);
	ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "900");
	ПараметрыТрансформацииВHTML.Вставить("Ширина1", "400");
	ПараметрыТрансформацииВHTML.Вставить("Ширина2", "120");
	ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
	ПараметрыТрансформацииВHTML.Вставить("Заголовок1", "Наименование ЦБ");
	ПараметрыТрансформацииВHTML.Вставить("Заголовок2", "ISIN");
	ПараметрыТрансформацииВHTML.Вставить("Положение3", "center");
	ПараметрыТрансформацииВHTML.Вставить("Положение4", "center");
	Заголовок3 = "Дата включения в перечень эмитентов акций высокотехнологичного (инновационного) сектора экономики";
	ПараметрыТрансформацииВHTML.Вставить("Заголовок3", Заголовок3);
	Заголовок4 = "Дата исключения из перечня эмитентов акций высокотехнологичного (инновационного) сектора экономики";
	ПараметрыТрансформацииВHTML.Вставить("Заголовок4", Заголовок4);
	
	СписокИзмененийВФормеТаблицыHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(ТаблицаИзмененныхЦБ, ПараметрыТрансформацииВHTML);
	
	Текст = "<html><BODY>" + "Добрый день!" + ПС + Символы.ПС
			+ "Для следующих ценных бумаг изменена дата включения/исключения в перечень бумаг инновационного сектора экономики:" + ПС + Символы.ПС
			+ СписокИзмененийВФормеТаблицыHTML + Символы.ПС;
	Текст = Текст + "</BODY></html>";
	
	Возврат Текст;
КонецФункции

#КонецОбласти


ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
